id: 919e0fc1-547e-4dde-954b-f5bdad3bec46
name: email forward enabled to an external source (ForwardTo/ForwardAsAttachmentTo/RedirectTo)
description: |
  This rule will trigger when an account sets email forward enabled to an external source. Could be a regular administrative action. Could also be an attacker backdooring the email account of a compromised users. 
  Investigation required. Rule part of a set of rules made to detect forwarding.
severity: Medium
requiredDataConnectors:
  - connectorId: Office356
    dataTypes:
      - OfficeActivity
queryFrequency: 2H
queryPeriod: 7H
triggerOperator: gt 
triggerThreshold: 0
tactics:
  - Persistence
  - Exfiltration
relevantTechniques:
  - T1114
query: |
  let TimeFrame = 1d;
  let domains = dynamic(["zolder.io" "rwxsecurity.nl"]);
  OfficeActivity
  | where TimeGenerated >= ago(TimeFrame) 
  | where Operation == "New-InboxRule"
  | extend details = parse_json(Parameters)
  | extend ruletype = tostring(details[2].Name) 
  | where ruletype in ( "ForwardTo" , "ForwardAsAttachmentTo", "RedirectTo")
  | extend forwardaddr = tostring(details[2].Value) 
  | extend forwarddomain = tostring(split(forwardaddr, "@")[1])
  | where isempty(forwarddomain) == false and forwarddomain !in (domains)
