id: 83ba3057-9ea3-4759-bf6a-933f2e5bc7ee
name: BEC Fraud rule sees mail move to folder based on content
description: |
 Checks to see if mail rules are created taht move to a suspicious folder if the subject or body contains a specific wordt.  Confidence goes up if emails one of the words that the rule looks for is something related to payments and invoices.
severity: High
requiredDataConnectors:
  - connectorId: Office365
    dataTypes:
      - OfficeActivity
queryFrequency: 2H
queryPeriod: 7H
triggerOperator: gt 
triggerThreshold: 0
tactics:
  - Persistence
relevantTechniques:
  - T1089
query: |
  OfficeActivity
  | where Operation == "New-InboxRule" or Operation == "Set-InboxRule"
  | extend details = parse_json(Parameters)
  | extend ruletype = tostring(details[2].Name) 
  | where ruletype in ( "MoveToFolder")
  | extend moveto = tostring(details[2].Value) 
  | where  moveto in ("Junk Email","Conversation History","RSS Subscriptions", "Archive")
  | extend triggertype = details[4].Name
  | where triggertype in ("SubjectOrBodyContainsWords", "SubjectContainsWords", "BodyContainsWords")
  | extend triggerlist = tostring(parse_json(details[4].Value))
  | extend confidence = case(triggerlist has "factuur" or triggerlist has "betaling", "high",
      triggerlist has "aanmaning" or triggerlist has "invoice", "high",
      triggerlist has "overboeking" or triggerlist has "payment", "high",
      "low") 