id: 6eccdacf-82f5-4d9d-bf37-421defaa1736
name: Detect user consent failing because Microsoft deemed it risky
description: |
  This query can be used to find user consent failing because the consent was deemed risky. Check 
severity: Low
requiredDataConnectors:
  - connectorId: AzureActiveDirectory
    dataTypes:
      - AuditLogs
queryFrequency: 2H
queryPeriod: 7H
triggerOperator: gt
triggerThreshold: 0
tactics:
relevantTechniques:
query: |
  AuditLogs
  | where OperationName == 'Consent to application'
  | extend applicationDetails = parse_json(TargetResources)[0]
  | where Result == "failure" and ResultDescription contains "Microsoft.Online.Security.UserConsentBlockedForRiskyAppsException"